# при билде контейнера докер кеширует каждй  из слоев, поэтому, например, если package.json не изменится, то 3 и 4 команда не отработает, что экономит все при перестройке контейнера
# базовй образ операцинной систем, 14 - версия нод
FROM node:14-alpine
# команд вполняются в рамках контейнера
# рабочая директория
WORKDIR /opt/app
# добавление зависимостей из package.json проекта в package.json контейнера
ADD package.json package.json
# установка зависимостей
RUN npm install
# добавление всей папки текущего проекта в текущую папку контейнера
ADD . .
# установка текущего NODE_ENV
ENV NODE_ENV production
RUN npm run build
# удаление всех зависимостей, не относящихся к продакшену (dev-dependencies)
RUN npm prune --production
# запуск приложения
CMD ["npm", "start"]
# порт
EXPOSE 3000

# команд для запуска  контейнера, . - путь до докер-файла; точка обозначает текущую папку
# запустить контейнер
# docker build -t app-title .
